package com.chsy.basics;

public class BiteCalculate {
    public static void main(String[] args) {
        /**
         *   A = 0011 1100
         *   B = 0000 1101
         * -------------------
         * A&B = 0000 1100  都为1才为1 否则0
         * A|B = 0011 1101  有1就为1 否则0
         * A^B = 0011 0001  相同则为0 否则1
         *  ~B = 1111 0010  取反
         *
         *  2*8 如何最快的计算 2*2*2*2
         *  效率极高！！！
         *  << 左移   *2
         *  >> 右移   /2
         *
         *  0000 0000    0
         *  0000 0001    1
         *  0000 0010    2
         *  0000 0011    3
         *  0000 0100    4
         *  0000 1000    8
         *  0001 0000    16
         */
        System.out.println(2<<3);
    }
}
